# Boat Sales 6.1
## Import Libraries & dataframe
## Consinstency checks and cleaning dataframe

In [3]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
path = 'C:/Users/sosia/OneDrive/Desktop/CF/Data immersion/6/6.1'

In [5]:
# Importing and imaging the dataset
df = pd.read_csv(r'C:\Users\sosia\OneDrive\Desktop\CF\Data immersion\6\6.1\archive\insurance.csv', index_col = False)

df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

# Consistency Checks & cleaning dataframe

In [7]:
# Dimensions of the dataframe 
df.shape

(1338, 7)

In [8]:
# Information of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [9]:
#Information about the data types in the dataframe
df.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

In [10]:
# Check for missing values and consistency
df['sex'].value_counts(dropna = False)
# No missing values were found;

sex
male      676
female    662
Name: count, dtype: int64

In [11]:
# Check for missing values and consistency
df['children'].value_counts(dropna = False)
# No missing values were found;

children
0    574
1    324
2    240
3    157
4     25
5     18
Name: count, dtype: int64

In [12]:
# Check for missing values and consistency
df['smoker'].value_counts(dropna = False)
# No missing values were found;

smoker
no     1064
yes     274
Name: count, dtype: int64

In [13]:
# Check for missing values and consistency
df['region'].value_counts(dropna = False)
# No missing values were found;

region
southeast    364
southwest    325
northwest    325
northeast    324
Name: count, dtype: int64

In [14]:
# Check for mixed data

for col in df.columns.tolist():
  weird = (df[[col]].map(type) != df[[col]].iloc[0].apply(type)).any(axis=1) 
  if len(df[weird]) > 0:
    print(f"Column '{col}' has mixed data types.")
    print(df[weird]) 

#No mixed data

In [15]:
# Check for missing data
df.isnull().sum()
# No missing data

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [16]:
# Address duplicate rows
df_dups = df[df.duplicated()]

In [20]:
df_dups

     age   sex    bmi  children smoker     region    charges
581   19  male  30.59         0     no  northwest  1639.5631

In [22]:
# Check the original dataframe
df.shape

(1338, 7)

In [24]:
# Cleaning the duplicates
df_clean = df.drop_duplicates()

In [25]:
# Checking the cleaned dataframe
df_clean.shape

(1337, 7)

In [29]:
# Understading data 
# Descriptive Statistics
df_clean.describe()

               age          bmi     children       charges
count  1337.000000  1337.000000  1337.000000   1337.000000
mean     39.222139    30.663452     1.095737  13279.121487
std      14.044333     6.100468     1.205571  12110.359656
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.290000     0.000000   4746.344000
50%      39.000000    30.400000     1.000000   9386.161300
75%      51.000000    34.700000     2.000000  16657.717450
max      64.000000    53.130000     5.000000  63770.428010

In [30]:
df_clean.describe().to_csv("descriptive_stats.csv")

In [34]:
df_clean

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1337 rows x 7 columns]

In [37]:
df_clean.to_csv(os.path.join(path, 'df_clean.csv'))